In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("/home/milesdao/Documents/Study/AIO/Module3/data visualization and analysis/code/example1/WeatherHistory2D.csv")

In [4]:
df.head()

                  Formatted Date  Temperature (C)
0  2006-01-01 00:00:00.000 +0100         0.577778
1  2006-01-01 01:00:00.000 +0100         1.161111
2  2006-01-01 02:00:00.000 +0100         1.666667
3  2006-01-01 03:00:00.000 +0100         1.711111
4  2006-01-01 04:00:00.000 +0100         1.183333

In [13]:
df["Formatted Date"] = pd.to_datetime(df["Formatted Date"], utc = False)


df["day"] = df["Formatted Date"].dt.day
df['month'] = df["Formatted Date"].dt.month

df['year'] = df["Formatted Date"].dt.year
df['hour'] = df["Formatted Date"].dt.hour

In [14]:
df.head()

             Formatted Date  Temperature (C)  month  day  year  hour
0 2005-12-31 23:00:00+00:00         0.577778     12   31  2005    23
1 2006-01-01 00:00:00+00:00         1.161111      1    1  2006     0
2 2006-01-01 01:00:00+00:00         1.666667      1    1  2006     1
3 2006-01-01 02:00:00+00:00         1.711111      1    1  2006     2
4 2006-01-01 03:00:00+00:00         1.183333      1    1  2006     3

In [15]:
df = pd.read_csv("/home/milesdao/Documents/Study/AIO/Module3/data visualization and analysis/code/advertising_simple.csv")

In [16]:
df_drop = df.drop(1, axis = 0)

In [17]:
df_drop

    TV  Radio  Newspaper  Sales
0   44     39         45     10
2  151     41         58     16
3  180     10         58     17
4    8     48         75      7
5   57     32         23     11
6  120     19         11     13
7    8      2          1      4

In [21]:
df_drop = df.drop([1,2,3], axis = 0)

In [22]:
df_drop

    TV  Radio  Newspaper  Sales
0   44     39         45     10
4    8     48         75      7
5   57     32         23     11
6  120     19         11     13
7    8      2          1      4

In [23]:
df = pd.read_csv("/home/milesdao/Documents/Study/AIO/Module3/data visualization and analysis/code/example2/train.csv")

In [29]:
df[df["id"] == 49]

,id,keyword,location,text,target
32,49,ablaze,Est. September 2012 - Bristol,We always try to bring the heavy. #metal #RT h...,0

In [35]:
df.drop(["id", "keyword", "location"], axis = 1 , inplace = True)

In [36]:
df.head()

                                                text  target
0  Our Deeds are the Reason of this #earthquake M...       1
1             Forest fire near La Ronge Sask. Canada       1
2  All residents asked to 'shelter in place' are ...       1
3  13,000 people receive #wildfires evacuation or...       1
4  Just got sent this photo from Ruby #Alaska as ...       1

In [57]:
he = df.groupby("target").size().values

In [59]:
print(he[0])
print(he[-1])

4342
3271

Convert catagorical to number

In [60]:
df = pd.read_csv("/home/milesdao/Documents/Study/AIO/Module3/data visualization and analysis/code/weatherHistory_simple.csv")

In [61]:
df.head()

  Precip Type  Temperature (C)
0        rain             12.2
1        rain             13.8
2        rain             14.7
3        rain             13.8
4        rain             12.7

In [62]:
df["Precip Type"].unique()

<StringArray>
['rain', 'snow']
Length: 2, dtype: str

In [75]:
df['Precip Type'] = pd.Categorical(df["Precip Type"]).codes

In [76]:
df.head()

   Precip Type  Temperature (C)
0            0             12.2
1            0             13.8
2            0             14.7
3            0             13.8
4            0             12.7

In [72]:
hello = df.copy()

In [73]:
hello["Precip Type"] = hello["Precip Type"].map({
    "rain" : 0,
    "snow" : 1
}).fillna(0).astype(int)

In [74]:
hello.head()

   Precip Type  Temperature (C)
0            0             12.2
1            0             13.8
2            0             14.7
3            0             13.8
4            0             12.7

In [77]:
df = pd.read_csv("/home/milesdao/Documents/Study/AIO/Module3/data visualization and analysis/code/advertising_simple.csv")

In [78]:
df

    TV  Radio  Newspaper  Sales
0   44     39         45     10
1   17     45         69     12
2  151     41         58     16
3  180     10         58     17
4    8     48         75      7
5   57     32         23     11
6  120     19         11     13
7    8      2          1      4

In [94]:
df.loc[1, "Radio"]

np.int64(45)

In [97]:
df.loc[ :, ["Radio", "Newspaper"]]

   Radio  Newspaper
0     39         45
1     45         69
2     41         58
3     10         58
4     48         75
5     32         23
6     19         11
7      2          1

In [ ]:
print(df.loc[1, 3]) # coloum phải đúng tên

In [102]:
df.loc[:, 'TV': 'Newspaper': 2]

    TV  Newspaper
0   44         45
1   17         69
2  151         58
3  180         58
4    8         75
5   57         23
6  120         11
7    8          1

In [ ]:
df.iloc[:, 'TV': 'Newspaper': 2] # error

In [105]:
df.iloc[ 2: 4, 1:3]

   Radio  Newspaper
2     41         58
3     10         58